# Core utilities
curl
wget
git
stow
nano
htop
iotop
nload

# Non-essential but very useful program
zsh
terminfo # ~/.zshrc dependency
zsh-syntax-highlighting # ZSH Plugin
zsh-autosuggestions # ZSH Plugin
iwconfig

haveged # Useful for some programs at boot that needs a good entropy

# Drivers
firmware-iwlwifi # Module for Intel wifi cards
firmware-misc-nonfree # Intel graphics driver

network-manager # Automatically handle network connections

# Audio and  brightness
brightnessctl
pulseaudio
alsa-utils

# X Server
xinit # startx and xinit
xwallpaper
xserver-xorg-video-intel

# Desktop core apps
i3-wm
i3lock
polybar
rofi
dunst
picom
rxvt-unicode
pavucontrol
nemo
network-manager-gnome
network-manager-openvpn-gnome # optional

# Polybar scripts
socat #mpv
jq    #mpv

# Desktop core utilites
mpv
sxiv
gedit
mousepad
zathura
deepin-screenshot
xclip # needed for deepin-screenshot hack to work

# Admin Tools
baobab
gparted
bsdmainutils # cal, whois, mailutils... commands
virt-manager # sudo usermod -a -G libvirt "$USER"
qemu-utils

# Useful apps
chromium
gimp
telegram-desktop
#texlive-full
