DavidAnson.vscode-markdownlint
dawidd6.debian-vscode
dracula-theme.theme-dracula
humao.rest-client
James-Yu.latex-workshop
mikestead.dotenv
ms-python.python
redhat.vscode-yaml
ryanluker.vscode-coverage-gutters
timonwong.shellcheck
